# ExportFontInfo Constructor (ExportFontInfo) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportFontInfo Constructor (ExportFontInfo)
ExportFontInfo Class See Also
---
Constructs a new copy of the input ExportFontInfo object.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ExportFontInfo(
	ExportFontInfo other
)
```

Visual Basic
---
```text
Public Sub New ( _
	other As ExportFontInfo _
)
```

Visual C++
---
```text
public:
ExportFontInfo(
	ExportFontInfo^ other
)
```

# ### Parameters
other
    Type: Autodesk.Revit.DB..::..ExportFontInfo
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExportFontInfo Class
ExportFontInfo Overload
Autodesk.Revit.DB Namespace